HuangShW/mymatter/esp32/main/main.cpp
Protocols::InteractionModel::Status HandleWriteOnOffAttribute(Device * dev, chip::AttributeId attributeId, uint8_t * buffer)
{
    ChipLogProgress(DeviceLayer, "HandleWriteOnOffAttribute: attrId=%" PRIu32, attributeId);

    VerifyOrReturnError((attributeId == OnOff::Attributes::OnOff::Id) && dev->IsReachable(),
                        Protocols::InteractionModel::Status::Failure);
    dev->SetOnOff(*buffer == 1);
    return Protocols::InteractionModel::Status::Success;
}

Protocols::InteractionModel::Status HandleReadLevelControlAttribute(Device * dev, chip::AttributeId attributeId, uint8_t * buffer,
                                                                   uint16_t maxReadLength)
{
    using namespace LevelControl::Attributes;
    ChipLogProgress(DeviceLayer, "HandleReadLevelControlAttribute: attrId=%" PRIu32 ", maxReadLength=%u", attributeId, maxReadLength);

    if ((attributeId == CurrentLevel::Id) && (maxReadLength >= 1))
    {
        // CurrentLevel is nullable uint8, but we'll always return a valid value
        *buffer = dev->GetCurrentLevel();
    }
    else if ((attributeId == RemainingTime::Id) && (maxReadLength >= 2))
    {
        // RemainingTime - we don't support transitions, so always 0
        uint16_t remainingTime = 0;
        memcpy(buffer, &remainingTime, sizeof(remainingTime));
    }
    else if ((attributeId == MinLevel::Id) && (maxReadLength >= 1))
    {
        *buffer = dev->GetMinLevel();
    }
    else if ((attributeId == MaxLevel::Id) && (maxReadLength >= 1))
    {
        *buffer = dev->GetMaxLevel();
    }
    else if ((attributeId == Options::Id) && (maxReadLength >= 1))
    {
        // Options bitmap - no special options supported
        *buffer = 0;
    }
    else if ((attributeId == OnOffTransitionTime::Id) && (maxReadLength >= 2))
    {
        // OnOffTransitionTime - no transition supported, so 0
        uint16_t transitionTime = 0;
        memcpy(buffer, &transitionTime, sizeof(transitionTime));
    }
    else if ((attributeId == OnLevel::Id) && (maxReadLength >= 1))
    {
        // OnLevel - level to use when turning on, null means use previous level
        // We'll return null (0xFF) to indicate using previous level
        *buffer = 0xFF;
    }
    else if ((attributeId == StartUpCurrentLevel::Id) && (maxReadLength >= 1))
    {
        // StartUpCurrentLevel - null means use previous level on startup
        *buffer = 0xFF;
    }
    else if ((attributeId == ClusterRevision::Id) && (maxReadLength >= 2))
    {
        uint16_t rev = 6; // Level Control cluster revision 6
        memcpy(buffer, &rev, sizeof(rev));
    }
    else
    {
        return Protocols::InteractionModel::Status::Failure;
    }

    return Protocols::InteractionModel::Status::Success;
}

Protocols::InteractionModel::Status HandleWriteLevelControlAttribute(Device * dev, chip::AttributeId attributeId, uint8_t * buffer)
{
    using namespace LevelControl::Attributes;
    ChipLogProgress(DeviceLayer, "HandleWriteLevelControlAttribute: attrId=%" PRIu32, attributeId);

    VerifyOrReturnError(dev->IsReachable(), Protocols::InteractionModel::Status::Failure);
    
    if (attributeId == CurrentLevel::Id)
    {
        uint8_t level = *buffer;
        // Validate level range (1-254, 0 is reserved for "level undefined")
        if (level == 0 || level > 254)
        {
            return Protocols::InteractionModel::Status::ConstraintError;
        }
        dev->SetLevel(level);
        return Protocols::InteractionModel::Status::Success;
    }
    else if (attributeId == Options::Id)
    {
        // Options attribute is writable but we don't support any options
        return Protocols::InteractionModel::Status::Success;
    }
    else if (attributeId == OnOffTransitionTime::Id)
    {
        // OnOffTransitionTime is writable but we don't support transitions
        return Protocols::InteractionModel::Status::Success;
    }
    else if (attributeId == OnLevel::Id)
    {
        // OnLevel is writable, store the value for potential future use
        // For now, we'll just accept it without storing
        return Protocols::InteractionModel::Status::Success;
    }

    return Protocols::InteractionModel::Status::Failure;
}

Protocols::InteractionModel::Status emberAfExternalAttributeReadCallback(EndpointId endpoint, ClusterId clusterId,
                                                                         const EmberAfAttributeMetadata * attributeMetadata,
                                                                         uint8_t * buffer, uint16_t maxReadLength)
{
    uint16_t endpointIndex = emberAfGetDynamicIndexFromEndpoint(endpoint);

    if ((endpointIndex < CHIP_DEVICE_CONFIG_DYNAMIC_ENDPOINT_COUNT) && (gDevices[endpointIndex] != NULL))
    {
        Device * dev = gDevices[endpointIndex];

        if (clusterId == BridgedDeviceBasicInformation::Id)
        {
            return HandleReadBridgedDeviceBasicAttribute(dev, attributeMetadata->attributeId, buffer, maxReadLength);
        }
        else if (clusterId == OnOff::Id)
        {
            return HandleReadOnOffAttribute(dev, attributeMetadata->attributeId, buffer, maxReadLength);
        }
        else if (clusterId == LevelControl::Id)
        {
            return HandleReadLevelControlAttribute(dev, attributeMetadata->attributeId, buffer, maxReadLength);
        }
    }

    return Protocols::InteractionModel::Status::Failure;
}

Protocols::InteractionModel::Status emberAfExternalAttributeWriteCallback(EndpointId endpoint, ClusterId clusterId,
                                                                          const EmberAfAttributeMetadata * attributeMetadata,
                                                                          uint8_t * buffer)
{
    uint16_t endpointIndex = emberAfGetDynamicIndexFromEndpoint(endpoint);

    if (endpointIndex < CHIP_DEVICE_CONFIG_DYNAMIC_ENDPOINT_COUNT)
    {
        Device * dev = gDevices[endpointIndex];

        if ((dev->IsReachable()) && (clusterId == OnOff::Id))
        {
            return HandleWriteOnOffAttribute(dev, attributeMetadata->attributeId, buffer);
        }
        else if ((dev->IsReachable()) && (clusterId == LevelControl::Id))
        {
            return HandleWriteLevelControlAttribute(dev, attributeMetadata->attributeId, buffer);
        }
    }

    return Protocols::InteractionModel::Status::Failure;
}

namespace {
void CallReportingCallback(intptr_t closure)
{
    auto path = reinterpret_cast<app::ConcreteAttributePath *>(closure);
    MatterReportingAttributeChangeCallback(*path);
    Platform::Delete(path);
}

void ScheduleReportingCallback(Device * dev, ClusterId cluster, AttributeId attribute)
{
    auto * path = Platform::New<app::ConcreteAttributePath>(dev->GetEndpointId(), cluster, attribute);
    DeviceLayer::PlatformMgr().ScheduleWork(CallReportingCallback, reinterpret_cast<intptr_t>(path));
}
} // anonymous namespace

void HandleDeviceStatusChanged(Device * dev, Device::Changed_t itemChangedMask)
{
    if (itemChangedMask & Device::kChanged_Reachable)
    {
        ScheduleReportingCallback(dev, BridgedDeviceBasicInformation::Id, BridgedDeviceBasicInformation::Attributes::Reachable::Id);
    }

    if (itemChangedMask & Device::kChanged_State)
    {
        ScheduleReportingCallback(dev, OnOff::Id, OnOff::Attributes::OnOff::Id);
    }

    if (itemChangedMask & Device::kChanged_Level)
    {
        ScheduleReportingCallback(dev, LevelControl::Id, LevelControl::Attributes::CurrentLevel::Id);
        
        // Implement OnOff and Level Control state synchronization
        // According to Matter spec, when Level > 0, OnOff should be true
        // When Level = 0 (should not happen as our range is 1-254), but if it did, OnOff should be false
        uint8_t currentLevel = dev->GetCurrentLevel();
        bool shouldBeOn = (currentLevel > 0);
        
        // Only update OnOff state if it differs from what Level suggests, to avoid circular updates
        if (dev->IsOn() != shouldBeOn)
        {
            // Temporarily set a flag to prevent recursive callbacks during sync
            // Note: We use the Changed_t mask to detect if this is already a sync operation
            if (!(itemChangedMask & Device::kChanged_State))
            {
                dev->SetOnOff(shouldBeOn);
            }
        }
    }

    if (itemChangedMask & Device::kChanged_Name)
    {
        ScheduleReportingCallback(dev, BridgedDeviceBasicInformation::Id, BridgedDeviceBasicInformation::Attributes::NodeLabel::Id);
    }
}

